/* Напишите программу, которая на вход
принимает два числа и выдаёт, какое число большее, а
какое меньшее. */

/* Console.WriteLine("Enter first numder:");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("Enter second numder:");
int b = int.Parse(Console.ReadLine());
if (a > b)
{
    Console.WriteLine("Max number:" + a);
}
if (b > a)
{
    Console.WriteLine("Max number:" + b);
}
else
{
    Console.WriteLine("The numbers are equal");
} */





/* Напишите программу, которая принимает на
вход три числа и выдаёт максимальное из этих чисел. */

/* Console.WriteLine("Enter first numder:");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("Enter second numder:");
int b = int.Parse(Console.ReadLine());
Console.WriteLine("Enter second numder:");
int c = int.Parse(Console.ReadLine());

int max = a;
if (a > max) max = a;
if (b > max) max = b;
if (c > max) max = c;
Console.WriteLine("Max number" + max); */





/* Напишите программу, которая на вход
принимает число и выдаёт, является ли число чётным
(делится ли оно на два без остатка). */

/* Console.WriteLine("Enter numder");
int a = int.Parse(Console.ReadLine());
if (a % 2 == 0)
{
    Console.WriteLine("Это чётное число");
}
else
{
    Console.WriteLine("Это нечётное число");
}  */




/* Напишите программу, которая на вход
принимает число (N), а на выходе показывает все чётные
числа от 1 до N. */

/* Console.WriteLine("Enter numder");
int N = int.Parse(Console.ReadLine());
int i = 1;
while (i <= N)
{
    if (i % 2 == 0)
    {
        Console.Write(i + " ");
    }
    i++;
}  */