/* Напишите программу, которая принимает на 
вход трёхзначное число и на выходе показывает вторую 
цифру этого числа */


/* Console.WriteLine("Enter three-digit number");
int number = int.Parse(Console.ReadLine());
if (number > 999)
{
    Console.WriteLine("Wrong number");
}
if (number < 100)
{
    Console.WriteLine("Wrong number");
}
else
{
    if ((number > 99) || (number < 1000))
    {
        number = number / 10;
    }
    int remain = number % 10;
    Console.WriteLine("Second number: " + remain);
}
 */

//__________________________________________________________________________________

/* Напишите программу, которая принимает на 
вход цифру, обозначающую день недели, и проверяет, 
является ли этот день выходным. */

/* Console.WriteLine("Enter number of day");
int number = int.Parse(Console.ReadLine());

if (number == 1)
{
    Console.WriteLine("No");
}
else if (number == 2)
{
    Console.WriteLine("No");
}
else if (number == 3)
{
    Console.WriteLine("No");
}
else if (number == 4)
{
    Console.WriteLine("No");
}
else if (number == 5)
{
    Console.WriteLine("No");
}
else if (number == 6)
{
    Console.WriteLine("Yay");
}
else if (number == 7)
{
    Console.WriteLine("Yay");
}
else
{
    Console.WriteLine("Not a day number");
} */


